orgCase/002_particle/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      kinematicCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection off;
 
    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
    }
 
    integrationSchemes
    {
        U               Euler;
    }
    sourceTerms
    {
    /*
    //U のスキームには "explicit" 
    と "semiImplicit" が選べる。
    スキームの後の数値は緩和係数らしい。
    */
    schemes
        {
            U           explicit 1;
        }
    }
}
 
constantProperties
{
    parcelTypeId    1;
 
    rhoMin          1e-15;
    minParticleMass 1e-15;
 
    rho0            964;
    youngsModulus   6e8;
    poissonsRatio   0.35;
 
    constantVolume  false;
}
 
subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }
 
    injectionModels
    {
        model1
        {
            type manualInjection;
            massTotal       0;
            parcelBasisType fixed;
            nParticle       1;
            SOI             0;
            positionsFile   "kinematicCloudPositions";
            U0              ( 0 0 0 );
            sizeDistribution
            {
                type        fixedValue;
                fixedValueDistribution
                {
                    value   0.02;
                }
            }
        }
    }
    dispersionModel none;
 
    patchInteractionModel standardWallInteraction;
 
    heatTransferModel none;
 
    surfaceFilmModel none;
 
    stochasticCollisionModel none;
 
    collisionModel pairCollision;
 
    radiation off;
 
    pairCollisionCoeffs
    {
        // Maximum possible particle diameter expected at any time
        maxInteractionDistance  0.02;
 
        writeReferredParticleCloud no;
 
        pairModel pairSpringSliderDashpot;
 
        pairSpringSliderDashpotCoeffs
        {
            useEquivalentSize   no;
            alpha               0.12;
            b                   1.5;
            mu                  0.52;
            cohesionEnergyDensity 0;
            collisionResolutionSteps 12;
        };
 
        wallModel wallLocalSpringSliderDashpot;
 
        wallLocalSpringSliderDashpotCoeffs
        {
            useEquivalentSize no;
            collisionResolutionSteps 12;
            movingWall
            {
                youngsModulus   1e10;
                poissonsRatio   0.23;
                alpha           0.12;
                b               1.5;
                mu              0.43;
                cohesionEnergyDensity 0;
            }
            fixedWalls
            {
                youngsModulus   1e10;
                poissonsRatio   0.23;
                alpha           0.12;
                b               1.5;
                mu              0.43;
                cohesionEnergyDensity 0;
            }
            frontAndBack
            {
                youngsModulus   1e10;
                poissonsRatio   0.23;
                alpha           0.12;
                b               1.5;
                mu              0.1;
                cohesionEnergyDensity 0;
            }
        };
    }
 
    standardWallInteractionCoeffs
    {
        type            rebound;
    }
}
 
cloudFunctions
{}


// ************************************************************************* //
